{
    "info": "A propos de moi",
    "aboutDescription": "Bonjour, je suis Yvann GERARD, je suis un game développeur junior fraîchement diplômé : ingénieur en développement logiciel d’une formation certifiée CTI.\n\nLors de mes études, j’ai appris à produire un code clair et structuré. J’ai appliqué ces méthodes pour des projets personnels, principalement dans le domaine du jeux-vidéo.\n\nLe fait de souvent travailler en équipe m’a fait prendre conscience que cela favorisait mon implication et renforçait l’efficacité de mon travail.\n\nJ’aimerai évoluer dans un studio indépendant, au sein d’une équipe soudée, en créant des jeux-vidéo innovants.",
    "projects": "Projets",
    "games": "Jeux",
    "aboutGames": "En quête d’améliorer mes techniques de développement, j’ai réalisé plusieurs concepts. Ces réalisations faites avec Unity ne sont pas des jeux à part entière mais des prototypes avec la base de leur gameplay.",
    "aboutElement": "Je voulais créer un concept dans lequel se trouverait de nombreuses interactions avec les ennemis et trouver un moyen de simplifier celles-ci.",
    "aboutTower": "Pour ce concept je souhaitais utiliser un axe de rotation ainsi que trouver un moyen de simplifier la création de déplacements ennemis.",
    "aboutPopulation": "Pour ce concept, je me suis davantage intéressé à l’UI. Je suis donc parti sur un jeu de création de population dépendante de statistiques de départ.",
    "aboutPathfinding": "J’ai créé un algorithme de pathfinding pour un test de Paradox interactive sur Kattis. Après avoir réalisé ce test, j’ai amélioré mon code pour réduire son temps d’exécution en dessous des résultats publiés par les autres candidats.",
    "aboutProjection": "Dans le but d’avoir une représentation de l’influence de deux soleils orbitant autour d’une planète dans un monde fantaisie, j’ai créé une application permettant la visualisation de celle-ci.",
    "aboutRaspberry": "J’ai utilisé une Raspberry Pi 4 pour avoir un serveur multimédia et un accès distant à mes données. Cela m’a aussi permis d’en apprendre plus sur le system linux et sa possible utilisation au sein d’une entreprise.",
    "challengesPreLink": "J'aime me confronter à des challenges pour découvrir de nouvelles fonctionnalités des languages ainsi que m'améliorer dans ceux-ci. Via le site",
    "challengesPostLink": ", j'ai effectué des katas (exercices de programmation) dans plusieurs langages qui m'intéressent",
    "tooltipProject" : "Cliquez pour accéder aux détails du projet"
}